---
kind: type
id: T:Autodesk.Revit.DB.Visual.AdvancedWood
source: html/1e8c37ad-69ea-aabc-df91-eda9c7fe54ff.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood

A static class that provides access to the property names that appear in the AdvancedWood visual asset schema.

## Syntax (C#)
```csharp
public static class AdvancedWood
```